---
kind: other
id: Methods.T:Autodesk.Revit.DB.AppearanceAssetElement
source: html/89549c7f-a91f-0467-a0a3-6532aa7596b6.htm
---
# AppearanceAssetElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.